Revit 2024 API
Application.NewFamilyInstanceCreationData Method (XYZ, FamilySymbol, Level, StructuralType)
Creates an object which wraps the arguments of NewFamilyInstance() for batch creation.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public FamilyInstanceCreationData NewFamilyInstanceCreationData(
	XYZ location,
	FamilySymbol symbol,
	Level level,
	StructuralType structuralType
)
Visual Basic
Public Function NewFamilyInstanceCreationData ( _
	location As XYZ, _
	symbol As FamilySymbol, _
	level As Level, _
	structuralType As StructuralType _
) As FamilyInstanceCreationData
Visual C++
public:
FamilyInstanceCreationData^ NewFamilyInstanceCreationData(
	XYZ^ location,
	FamilySymbol^ symbol,
	Level^ level,
	StructuralType structuralType
)
Parameters
location
Type: Autodesk.Revit.DB.XYZ
 The physical location where the instance is to be placed.
symbol
Type: Autodesk.Revit.DB.FamilySymbol
 A FamilySymbol object that represents the type of the instance that is to be inserted.
level
Type: Autodesk.Revit.DB.Level
 A Level object that is used as the base level for the object.
structuralType
Type: Autodesk.Revit.DB.Structure.StructuralType
 If structural then specify the type of the component.
See Also
Application Class
NewFamilyInstanceCreationData Overload
Autodesk.Revit.Creation Namespace